<template>
  <svg
    width="160"
    height="160"
    viewBox="0 0 160 160"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      fill-rule="evenodd"
      clip-rule="evenodd"
      d="M119.58 50.6083C129.775 67.0886 142.037 87.3785 133.481 104.775C124.974 122.07 100.313 119.744 82.2533 126.5C64.445 133.162 46.7171 152.629 30.071 143.462C13.3425 134.249 17.8884 109.157 16.2269 90.1388C15.1576 77.8951 19.0878 67.0493 22.361 55.1997C26.6876 39.536 23.6017 18.409 38.0829 11.0151C52.665 3.5696 68.7834 16.8295 83.5035 23.981C97.4815 30.7718 111.408 37.3971 119.58 50.6083Z"
      fill="#F2B679"
      fill-opacity="0.3"
    />
    <path
      d="M123.392 93.2777L114.925 84.811C114.396 84.2819 113.678 83.9847 112.93 83.9847C112.182 83.9847 111.464 84.2819 110.935 84.811L84.7077 111.038V123.495H97.1649L123.392 97.2683C123.921 96.7391 124.218 96.0214 124.218 95.273C124.218 94.5246 123.921 93.8069 123.392 93.2777ZM94.8281 117.851H90.3521V113.375L104.463 99.2636L108.939 103.74L94.8281 117.851ZM112.93 99.749L108.454 95.273L112.93 90.797L117.406 95.273L112.93 99.749ZM62.1299 83.9841H90.3521V89.6286H62.1299V83.9841ZM62.1299 67.0508H95.9965V72.6952H62.1299V67.0508Z"
      fill="#424242"
    />
    <path
      d="M112.93 50.1171C112.928 48.6206 112.333 47.1857 111.275 46.1275C110.217 45.0693 108.782 44.4742 107.285 44.4727H50.8408C49.3442 44.4742 47.9094 45.0693 46.8512 46.1275C45.793 47.1857 45.1978 48.6206 45.1963 50.1171V86.806C45.19 92.4345 46.7167 97.9584 49.6125 102.785C52.5082 107.611 56.6637 111.558 61.6329 114.201L76.2407 121.991V115.593L64.2915 109.22C60.2256 107.057 56.8254 103.828 54.4558 99.8796C52.0861 95.9308 50.8364 91.4112 50.8408 86.806V50.1171H107.285V75.5171H112.93V50.1171Z"
      fill="#424242"
    />
  </svg>

  <div class="w-[600px] font-roboto text-[#424242]">
    <p class="font-[700] p-3 text-left text-[25px] leading-[35px] text-center">
      Сохраняйте опыт компании с помощью Регламентов
    </p>
    <p class="font-[400] text-[18px] text-center leading-[28px]">
      ЛидерТаск научит и аттестует каждого сотрудника по вашим регламентам. Больше не надо повторять одно и то же и лично обучать новичков
    </p>
  </div>
  <OnBoardingButton
    @okToModal="okToModal"
  />
</template>
<script>
import OnBoardingButton from '../onBoarding/onBoardingButton.vue'

export default {
  components: { OnBoardingButton },
  emits: ['okToModal'],
  methods: {
    okToModal () {
      this.$emit('okToModal')
    }
  }
}
</script>
