<template>
  <div
    class="flex flex-col items-center max-w-[600px] mt-[100px] mx-auto"
  >
    <svg
      width="160"
      height="160"
      viewBox="0 0 160 160"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
    >
      <path
        fill-rule="evenodd"
        clip-rule="evenodd"
        d="M119.58 50.6083C129.775 67.0886 142.037 87.3785 133.481 104.775C124.974 122.07 100.313 119.744 82.2533 126.5C64.445 133.162 46.7171 152.629 30.071 143.462C13.3425 134.249 17.8884 109.157 16.2269 90.1388C15.1576 77.8951 19.0878 67.0493 22.361 55.1997C26.6876 39.536 23.6017 18.409 38.0829 11.0151C52.665 3.5696 68.7834 16.8295 83.5035 23.981C97.4815 30.7718 111.408 37.3971 119.58 50.6083Z"
        fill="#F2B679"
        fill-opacity="0.3"
      />
      <path
        d="M112.849 58.8857V54.4671C112.849 50.3684 109.536 47.0294 105.47 47.0294H75.0609L74.1485 45.5099C73.5931 44.6301 72.6211 44.0703 71.5896 44.0703H49.0558C44.9894 44.0703 41.6768 47.4093 41.6768 51.508V107.611C41.6768 111.709 44.9894 115.048 49.0558 115.048H112.035C116.102 115.048 119.415 111.709 119.415 107.611V66.2834C119.434 62.4446 116.538 59.2856 112.849 58.8857ZM47.6673 51.508C47.6673 50.7283 48.302 50.0885 49.0756 50.0885H69.9234L78.0165 63.4043C78.5521 64.2841 79.5241 64.8439 80.5754 64.8439H112.075C112.849 64.8439 113.484 65.4837 113.484 66.2634V107.611C113.484 108.39 112.849 109.03 112.075 109.03H49.0558C48.2822 109.03 47.6474 108.39 47.6474 107.611V51.508H47.6673ZM106.858 58.8257H82.2218L78.7108 53.0475H105.45C106.223 53.0475 106.858 53.6873 106.858 54.4671V58.8257Z"
        fill="#424242"
      />
    </svg>

    <div class="w-[600px] font-roboto text-[#424242]">
      <p class="font-[700] p-3 text-left text-[25px] leading-[35px] text-center">
        Организуйте командную работу над задачами с помощью Проектов
      </p>
      <p class="font-[400] text-[18px] text-center leading-[28px]">
        Добавьте участников проекта, а ЛидерТаск обеспечит его сдачу точно в срок
      </p>
    </div>
    <OnBoardingButton
      @okToModal="onOk"
    />
  </div>
</template>

<script>
import OnBoardingButton from '../onBoarding/onBoardingButton.vue'
export default {
  components: { OnBoardingButton },
  emits: ['ok'],
  methods: {
    onOk () {
      this.$emit('ok')
    }
  }
}
</script>

<style scoped></style>
